
<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>不会开机的男孩</title>
	<meta name="author" content="studentdeng">

	
	<meta name="description" content="上一篇主要是很初略的总结了是什么，这篇要总结下为什么。以下部分参照了http://msdn.microsoft.com/en-us/magazine/cc301727.aspx和http://blog.donews.com/zwell/archive/2005/10/21/596302. &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="不会开机的男孩" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
	<script async="true" src="//ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
	
</head>


<body>
	<header id="header" class="inner"><h1><a href="/">不会开机的男孩</a></h1>
<nav id="main-nav"><ul class="main">
	<li><a href="/">Blog</a></li>
	<li><a href="/blog/archives">Archives</a></li>
	<li><a href="/tags/index.html">Tags</a></li>
	<li><a href="/favorite/index.html">Favorite</a></li>
	<li><a href="/about/index.html">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
	<li><a href="/">Blog</a></li>
	<li><a href="/blog/archives">Archives</a></li>
	<li><a href="/tags/index.html">Tags</a></li>

    <article class="post">
	<h2 class="title">
		
		<a href="/blog/2010/09/18/reading-tips/">
		
			杂感</a>
	</h2>
	<div class="entry-content">
		<p>本来该睡了。但是一本好书，使我不得不在深夜爬起来重新思考下。一些点点滴滴。</p>

<p>1、无论何时，都可能突然碰壁
研究，是一种难以预料结果的工作。研究者在开始一项构思优秀的研究之前，都会假设这样的一个场景： “做了这个就会得出这样的结果，产生这样的作用” ，进而预计最终会取得什么样的成果。 做了一段时间后发现很顺利， 自然而然就确信一定会达到预期的目标， 但实际中，很可能会做着做着就进行不下去了。这时，研究者就会怀疑是否能达到预期的目标，甚至有的时候都怀疑自己研究的问题是否有价值。而后就越发不安，越发进行不下去了。研究与做练习题不同。教科书上每章章末的习题，不论多么困难，但只要应用这章所学的定理和思考方法就一定能解答。研究却与其有着本质的区别。</p>

<p>2、无论做哪种研究，不管是难还是简单，在开始之前都是充满希望的。多数情况不会一开始就走到了尽头。经历了千辛万苦取得成功之后，可能又会觉得不敢相信： “真的这样就解决了吗？”  研究的过程中经常有两种感觉： “能不能行呢？”这种不安感，以及“啊！成功了！ ”这种成就感。研究者亲身体验这两种感觉将成为智慧体力强有力的基石。</p>

<p>3、总是有很多人说要研究高端的东西，要深入研究数学，要研究本质的基础的东西，并以此为目标。其实这些都不算是目标，都是对研究的性质或者是结果的一种希望，希望通过某个具体研究项目而能够研究到本质。 如果真的是以研究本质为目标的话， 研究肯定会是行不通的，就会考虑： “这样一直研究下去就会得到好结果吗？现在是不是在解决本质的问题呢？”这时，已经不是在思考问题本身了， 而是在顾虑这样做下去的意义与成果，失去了研究的心态，陷于无尽的烦恼当中。</p>

<p>4、与别人交流自己的构想，并不一定是要征求对方的回答，或听取对方的意见。即便那个人是这方面的专家也没关系。把自己的构想跟他人交流，是要锤炼自己的想法，发现不完备之处。</p>

<p>只在自己的头脑中思考构想，是暗地里的思考，那样就会总觉得自己的想法是完全正确的，无法发现其中的纰漏。而跟他人交流时，要想得到对方的理解，就要清清楚楚、明明白白地讲出来。比如，讲解的时候说“这个想法可是很好的啊！ ”对方一定会问： “你说好，那理由是什么呢？”这个时候我们就得给予明确的解释了，进而就可以发现自己的构想哪个地方还有漏洞。</p>

<p>5、好的构想正是来自于荒唐无稽的想法。 认真的人做事情的时候，一定会尽力避免失败，一步一个台阶迈向成功。但是，为了产生出好的构想，发明出独创的技术，极端一些，可以说是荒唐无稽，通常我们称之为思想的飞跃。这一点，对于研究者是必不可少的。 而从现状出发，进行逻辑推理，最终得出结论。像这样的思考方法就很难实现飞跃。要想成功的话就直接从结论起步去做，也就是要从希望的结果开始做下去。这就是一种外行人的思考方法。</p>

<p>一些有趣的论点。</p>

<p>1、《2001 年宇宙之旅》的原作者亚瑟 C  克拉克曾写过三条很有趣的技术法则。</p>

<p>第一条：科学工作者声明某件事情是可行的时候，基本上他不会错。但当他说不可能的时候，他很可能错了。
第二条：发现极限在哪里的惟一方法就是超越极限，尝试向稍微超越这个极限的领域迈进、冒险。
第三条：无论是哪种技术，只要它是非常先进的，那看起来都跟魔术没什么区别。</p>

<p>2、但凡从事伟大事业的人都有一些共同的特征。首先，他们都很博学。不仅局限于自身研究的领域，也涉猎其他的领域。其次，他们头脑反应都很快。他们不仅能在交谈的时候迅速反应出对方说的与自己要说的有什么共同点与矛盾的地方，其间有什么理论联系，并能一下子引证与之相关的事实。所以听他讲东西很有趣，很带劲。这些人都很会开玩笑。他们开玩笑，会把生活中的琐事与自己所研究的领域结合起来，把其间的共同点与矛盾的地方夸大，让人很明显地感觉到其中奇怪的地方，说得就像是真事一样。</p>

<p>今天就先到这里吧，思维这个东西，一旦停滞下来。马上就会被睡意笼罩。</p>

		
		
	</div>


<div class="meta">
	<div class="date">








  


<time datetime="2010-09-18T02:26:00+08:00" pubdate data-updated="true">Sep 18<span>th</span>, 2010</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/emotion/'>emotion</a>


</div>
	
	<div class="comments"><a href="/blog/2010/09/18/reading-tips/#disqus_thread">Comments</a></div>
	
</div>
</article>


    <article class="post">
	<h2 class="title">
		
		<a href="/blog/2010/06/07/c-plus-plus-vtable2/">
		
			再谈C++虚继承</a>
	</h2>
	<div class="entry-content">
		<p>上一篇只是初步的写了一下虚继承，很不清楚而且有的地方自己理解也不到位。这回详细总结一下。以下内容来自vs2008 默认设置下。类的布局可以通过-d1reportSingleClassLayout查看。</p>

<p>让我们从最简单的类结构开始。</p>

<pre><code>class A
{
public:
    int a;
    void af();
    void virtual vaf(); 
};
void A::vaf(){printf("vaf\n");}
void A::af(){printf("af\n");}
class B
{
public:
    int b;
    void bf();
    void virtual vbf();
};
void B::vbf(){printf("vbf\n");};
void B::bf(){printf("bf\n");};
class C:public A,public B
{
public:
    int c;
    void cf();
    void virtual vcf();    
};
void C::vcf(){printf("vcf\n");}
void C::cf(){printf("cf\n");}
</code></pre>

<p>　　内存中这个例子是这样的。</p>

<pre><code>class A    size(8):
    +---
    | {vfptr}
    | a
    +---

A::$vftable@:
    | &amp;A_meta
    |  0
    | &amp;A::vaf


class B    size(8):
    +---
    | {vfptr}
    | b
    +---

B::$vftable@:
    | &amp;B_meta
    |  0
    | &amp;B::vbf

class C    size(20):
    +---
    | +--- (base class A)
    | | {vfptr}
    | | a
    | +---
    | +--- (base class B)
    | | {vfptr}
    | | b
    | +---
    | c
    +---

C::$vftable@A@:
    | &amp;C_meta
    |  0
    | &amp;A::vaf
    | &amp;C::vcf

C::$vftable@B@:
    | -8
    | &amp;B::vbf
</code></pre>

<p>这里我们总结一下，类中有虚函数布局。</p>

<p>若是类中有虚函数，那么类中第一个元素是指向虚表的指针（这个情况只有vftable）。
基类数据成员
本身类成员
最左边的基类和本类公用同一个虚函数表，从而可以简化一些操作。
　　一个简单的例子，让我们看一下虚函数运行时的样子。</p>

<pre><code>C *pc= new C;
pc-&gt;af();
pc-&gt;vaf();
pc-&gt;vcf();
pc-&gt;vbf();
delete pc;
.text:00401059                 push    offset aAf      ; "af\n";这里调用非虚函数，之前有一个给ecx赋值语句
.text:0040105E                 call    ds:__imp__printf
.text:00401064                 mov     eax, [esi]
.text:00401066                 mov     edx, [eax]
.text:00401068                 add     esp, 4
.text:0040106B                 mov     ecx, esi         ;这里ecx指向类A，这里因为A和C相同的开始地址
.text:0040106D                 call    edx              ;这里节省了一次类的转化
.text:0040106F                 mov     eax, [esi]
.text:00401071                 mov     edx, [eax+4]     ;这里调用vcf，在虚表中我们看到了他的offset 4
.text:00401074                 mov     ecx, esi
.text:00401076                 call    edx
.text:00401078                 mov     eax, [esi+8]     ;这里调用vbf,这里需要首先调整this指针
.text:0040107B                 mov     edx, [eax]       ;在找到相应的函数偏移量（这里为0）
.text:0040107D                 lea     ecx, [esi+8]
.text:00401080                 call    edx
</code></pre>

<p>有了前面的铺垫，我们步入正题，依然是一个简单的例子。</p>

<pre><code>class D :virtual public A
{
    int d;
    void df();
    void virtual vdf();
};
void D::vdf(){printf("vdf\n");}
void D::df(){printf("df\n");}
class E :virtual public A
{
public:
    int e;
    void ef();
    void virtual vef();
};
void E::vef(){printf("vef\n");}
void E::ef(){printf("ef\n");}
class F :public A,public B
{
public:
    int f;
    void ff();
    void virtual vff();
};
void F::vff(){printf("vff\n");}
void F::ff(){printf("ff\n");}
</code></pre>

<p>让我们再看一下class F在内存中的布局</p>

<pre><code>class F    size(36):
    +---
    | +--- (base class D)
    | | {vfptr}
    | | {vbptr}
    | | d
    | +---
    | +--- (base class E)
    | | {vfptr}
    | | {vbptr}
    | | e
    | +---
    | f
    +---
    +--- (virtual base A)
    | {vfptr}
    | a
    +---

F::$vftable@D@:
    | &amp;F_meta
    |  0
    | &amp;D::vdf
    | &amp;F::vff

F::$vftable@E@:
    | -12
    | &amp;E::vef

F::$vbtable@D@:
    | -4
    | 24 (Fd(D+4)A)

F::$vbtable@E@:
    | -4
    | 12 (Fd(E+4)A)

F::$vftable@A@:
    | -28
    | &amp;A::vaf
</code></pre>

<p>这里又增加了一个指向虚基表的指针vbptr，我们可以看出这个指针的目的在于计算包含虚继承的类的位置（有直接虚继承和间接虚继承）。让我们总结下有虚继承下的布局。</p>

<p>将类中非虚继承的基类放置最前面。这样访问非虚继承函数不需再计算偏移量。
在派生类中若是没有vbtable则增加一个，除非能从原来的非虚继承类继承到了vbtable。
派生类数据成员
虚基类
　　可见，虚基类始终在类的尾部，那么当类生长的时候，也就是继续被继承时，则很有可能使虚基的偏移量变大。</p>

<p>比如在class D的虚基表中，D与A偏移量为0，而在class F中D与A偏移量变为了24，所以只能加入一个vbptr指向虚基表。</p>

<p>有了前面的知识，那么运行时的情况就好分析了。</p>

<pre><code>.text:0040104F     mov     dword ptr [eax+4], offset ??_8F@@7BD@@@ ; const F::`vbtable'{for `D'}
.text:00401056     mov     dword ptr [eax+10h], offset ??_8F@@7BE@@@ ; const F::`vbtable'{for `E'}
                                                         ;首先将虚基表初始化 eax=this
.text:0040105D     mov     dword ptr [eax+1Ch], offset ??_7A@@6B@ ; const A::`vftable'
.text:00401064     mov     ecx, [eax+4]      ;*ecx=vbtableFD
.text:00401067     mov     dword ptr [eax], offset ??_7D@@6B0@@ ; const D::`vftable'{for `D'}
.text:0040106D     mov     edx, [ecx+4]      ;获得vbtableFD表中第2项，也就是D和A虚函数表的offset
.text:00401070     mov     dword ptr [edx+eax+4], offset ??_7D@@6BA@@@ ; const D::`vftable'{for `A'}
                                             ;根据和虚基表的offset+虚基表中和虚函数的offset+this找到虚函数位置以下类推
.text:00401078     mov     ecx, [eax+10h]
.text:0040107B     mov     dword ptr [eax+0Ch], offset ??_7E@@6B0@@ ; const E::`vftable'{for `E'}
.text:00401082     mov     edx, [ecx+4]
.text:00401085     mov     dword ptr [edx+eax+10h], offset ??_7E@@6BA@@@ ; const E::`vftable'{for `A'}
.text:0040108D     mov     ecx, [eax+4]
.text:00401090     mov     dword ptr [eax], offset ??_7F@@6BD@@@ ; const F::`vftable'{for `D'}
.text:00401096     mov     dword ptr [eax+0Ch], offset ??_7F@@6BE@@@ ; const F::`vftable'{for `E'}
.text:0040109D     mov     edx, [ecx+4]
.text:004010A0     mov     dword ptr [edx+eax+4], offset ??_7F@@6BA@@@ ; const F::`vftable'{for `A'}
.text:004010A8     mov     esi, eax

.text:004010AE     mov     eax, [esi+4]            ;eax=*vbtableFD
.text:004010B1     mov     ecx, [eax+4]            ;ecx=虚基表中和虚函数的offset
.text:004010B4     mov     edx, [ecx+esi+4]        ;*edx=vftable
.text:004010B8     mov     eax, [edx]              
.text:004010BA     lea     ecx, [ecx+esi+4]        ;this=class A的开始
.text:004010BE     call    eax                     ;pf-&gt;vaf();
.text:004010C0     mov     edx, [esi]
.text:004010C2     mov     eax, [edx]
.text:004010C4     mov     ecx, esi                ;classD和classF公用虚表
.text:004010C6     call    eax
.text:004010C8     mov     edx, [esi+0Ch]
.text:004010CB     mov     eax, [edx]
.text:004010CD     lea     ecx, [esi+0Ch]          ;修正this，指向class E
.text:004010D0     call    eax
.text:004010D2     mov     edx, [esi]
.text:004010D4     mov     eax, [edx+4]
.text:004010D7     mov     ecx, esi
.text:004010D9     call    eax
</code></pre>

<p>　　再看下虚函数覆盖的问题。</p>

<pre><code>class G
{
public:
    int g;
    void gf();
    void virtual vgf();
    void virtual vaf();
};
void G::gf(){printf("gf\n");}
void G::vgf(){printf("vgf\n");}
void G::vaf(){printf("vaf_g\n");}
class H:public A,public G
{
public:
    int h;
    void hf();
    void vaf();
    void vgf();
    void virtual vhf();
};
void H::hf(){printf("hf\n");}
void H::vaf(){printf("vaf_H\n");}
void H::vgf(){printf("vgf_h\n");}
void H::vhf(){printf("vhf\n");}


class H    size(20):
    +---
    | +--- (base class A)
    | | {vfptr}
    | | a
    | +---
    | +--- (base class G)
    | | {vfptr}
    | | g
    | +---
    | h
    +---

H::$vftable@A@:
    | &amp;H_meta
    |  0
    | &amp;H::vaf
    | &amp;H::vhf

H::$vftable@G@:
    | -8
    | &amp;H::vgf
    | &amp;thunk: this-=8; goto H::vaf
</code></pre>

<p>由于A类和G类的函数vaf都被子类H覆盖，由于A和H共用虚函数表，那么如果在G类中依然保留被覆盖的函数则浪费空间。实际是通过以下代码实现的。</p>

<pre><code>.text:004010B0 ; [thunk]:public: virtual void __thiscall H::vaf`adjustor{8}' (void)
.text:004010B0 ?vaf@H@@W7AEXXZ proc near               ; DATA XREF: .rdata:00402158o
.text:004010B0                 sub     ecx, 8          ;这里调整this指针，指向class G=class A
.text:004010B3                 jmp     ?vaf@H@@UAEXXZ  ; H::vaf(void);转向到G表中的vaf()
.text:004010B3 ?vaf@H@@W7AEXXZ endp
</code></pre>

<p>可见要是要使用thunk，根本上是处理以达到节省函数表大小，通过修改this指针去调用子类表项，那么也就是当子类覆盖父类多个方法时，只保留一份，其他的则跳转执行。</p>

<pre><code>mov     ecx, esi
call    edx                   ;调用vaf
